Revit 2024 API
MEPHiddenLineSettings.GetMEPHiddenLineSettings Method
 Gets the MEP hidden line settings in the document.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public static MEPHiddenLineSettings GetMEPHiddenLineSettings(
	Document doc
)
Visual Basic
Public Shared Function GetMEPHiddenLineSettings ( _
	doc As Document _
) As MEPHiddenLineSettings
Visual C++
public:
static MEPHiddenLineSettings^ GetMEPHiddenLineSettings(
	Document^ doc
)
Parameters
doc
Type: Autodesk.Revit.DB.Document
 The document where the settings element is found.
Return Value
 The element which stores the MEP hidden line settings for the document.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
MEPHiddenLineSettings Class
Autodesk.Revit.DB.Mechanical Namespace